
import React, { useEffect } from 'react';
import './Author.css';

const Author = () => {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  return (
    <div className="detail-layout">
      <div className="detail-content">
        <h2 className="detail-heading"><span>مصنف کا تعارف</span></h2>
        <p className="detail-text">

          <p className="about-author">
            تقسیم ہند سے قبل ضلع امرتسر کے ایک ممتاز عالم دین حضرت
            <span className="highlight-ataullah">مولانا عطاء اللہ شہید</span> رَحْمَةُ اللهِ عَلَيْهِ کی خدماتِ علمی کا بڑا شہرہ تھا۔
            انھوں نے <span className="highlight-date">اگست 1947ء</span> میں سکھوں کے ایک جتھے کے ساتھ مقابلہ کرتے ہوئے مرتبہ شہادت پایا۔
            <span className="highlight-hafiz-suleman">حافظ محمد سلیمان</span> اسی فاضل شخصیت کے لائق فرزند ہیں جن کو اللہ تعالی نے قدیم و جدید علوم سے بہرہ مند فرمایا۔
            <span className="highlight-hafiz-suleman">حافظ محمد سلیمان</span> صاحب امرتسر کے ایک گاؤں بھینی سدھواں میں
            <span className="highlight-date">یکم دسمبر 1928ء</span> کو پیدا ہوئے۔ <span className="highlight-date">13</span> سال کی عمر تک درس نظامی پڑھا اور قرآن پاک حفظ کیا۔
            <span className="highlight-date">1945ء</span> میں ایم. بی. ہائی سکول جنڈیالہ ضلع امرتسر سے میٹرک کے امتحان میں ضلع بھر میں اول آئے۔
            اپنی پیشہ وارانہ زندگی کا آغاز بحیثیت ان ٹرینڈ ٹیچر کیا اور اسٹنٹ انسپکٹر آف سکولز برائے تعلیمی منصوبہ بندی کے عہدے تک پہنچے۔
            <span className="highlight-date">1966ء</span> میں ایم.ایڈ کیا۔ گورنمنٹ کالج فار ایلیمنٹری ٹیچرز فیصل آباد میں بطور سبجیکٹ سپیشلسٹ تعینات ہوئے۔
            کالج کے مجلہ "تعلیم وتحقیق" کے حصہ انگریزی میں بطور چیف ایڈیٹر خدمات انجام دیں۔ اسی کالج سے بطور وائس پرنسپل ریٹائر ہوئے۔
            آپ نے زندگی کے مختلف پہلوؤں کا بغور مشاہدہ فرمایا اور اپنے نقطہ نظر کے مطابق ان پر روشنی ڈالی۔اُنہوں نے طالبِ علمانہ ذوق و شوق کو تمام عمر برقرار رکھا۔
            مطالعۂ کتب میں وہ اپنی ترجیحات کے مطابق اہداف برقرار رکھتے تھے۔
            محسنِ انسانیت کی سیرتِ پاک اور احادیثِ مبارکہ اس ضمن میں سر فہرست ہیں۔
            <span className="highlight-date">اگست 2008ء</span> میں بدقسمتی سے ان کے دونوں کولہوں کی ہڈیاں فریکچر ہو گئیں اور اسی ماہ
            <span className="highlight-date">29 اگست 2008ء</span> کو اس جہانِ فانی سے کوچ فرما گئے۔ إِنَّا لِلّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ!
            اللہ تعالیٰ مغفرت فرمائے اور مرحوم کے درجات بلند فرمائے (آمین ثم آمین)۔
          </p>

          <p>
            <span className="list-of-books-heading">
              آپ کی تصانیف کے زمرہ میں مندرجہ ذیل کتب شامل ہیں:
            </span>

            <ol className="list-of-books">
              <li>رسول اکرم <strong>ﷺ</strong> پر درود وسلام بھیجنے کی فرضیت، تاکید اور فضائل آیات قرآنیہ اور احادیث صحیحہ کی روشنی میں</li>
              <li>محسن انسانیت <strong>ﷺ</strong> کی سیرت حالات حاضرہ کے تناظر میں </li>
              <li>توحید پر ایمان اور شرک سے بیزاری آیات قرآنیہ اور احادیث صحیحہ کی روشنی میں</li>
              <li>زندگی کا منظر نامہ شعر و ادب کے سائے میں</li>
            </ol>
          </p>

          <p className="about-author">
            اس ویب سائٹ کی تیاری مصنف کے پوتے،
            <span className="highlight-usama">اسامہ شاہد</span>،
            نے اپنے دادا محترم
            <span className="highlight-hafiz-suleman">حافظ محمد سلیمان</span>
            کے علمی، فکری اور ادبی ورثے کو محفوظ کرنے اور اسے آنے والی نسلوں تک منتقل کرنے کی نیت سے نہایت خلوص اور احترام کے ساتھ کی ہے۔
            اس کا مقصد نہ صرف ان کی علمی خدمات کو خراجِ تحسین پیش کرنا ہے بلکہ اُن کے خیالات اور تعلیمات کی روشنی کو ہمیشہ قائم رکھنا ہے۔
          </p>

        </p>
      </div>
    </div>
  )
}

export default Author;
