
import React, { useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
// import SideNav from '../SideNav/SideNav';

const ContentsDetail6 = ({ language }) => {
  const navigate = useNavigate();

  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  const handlePrevious = () => {
    window.scrollTo(0, 0);
    navigate('/contents/detail/5');
  };

  const handleNext = () => {
    window.scrollTo(0, 0);
    navigate('/contents/detail/7');
  };

  const isUrdu = language === 'ur';

  return (
    <div className="detail-layout">
      {/* <SideNav /> */}

      <div className="detail-content">
        <h2 className="detail-heading"><span>صلوٰۃ و سلام بھیجنے والوں کے لیے بشارتیں</span></h2>

        <p className="detail-text-refined-text">
          <span className="duaa">
            عن ابی هريرة ان رسول الله <strong>صلى الله عليه وآله وسلم</strong>
            قال من صلى على واحدة صلى الله عليه عشرا -<br />
            [صحیح مسلم، کتاب الصلاة، باب الصلاة على النبی <strong>صلى الله عليه وآله وسلم</strong>
            بعد التشهد
            ]          </span> <br />
          حضرت ابو ہریرہ رضی اللہ عنہ نے رسول اکرم <strong>صلى الله عليه وآله وسلم</strong>
          کا ارشاد عالی بیان کیا ہے: جو شخص مجھ پر ایک مرتبہ درود پڑھے گا اللہ تعالیٰ اُس پر دس مرتبہ اپنی بے پایاں رحمتیں نازل فرمائے گا اور خصوصی عنایات سے نوازے گا۔

          <br />          <span className="duaa">
            عن عبد الله بن ابی طلحة عن ابيه ان رسول الله <strong>صلى الله عليه وآله وسلم</strong>
            جاء ذات يوم والبشرى يرى فی وجهه فقال انه جاء نی جبريل عليه السلام فقال : اما يرضيك يا <strong>محمد</strong> ان لا يصلى عليك احد من امتك الا صليت عليه عشرا و لا يسلم عليك احدا من امتك الا سلمت عليه عشرا.<br />
            [سنن النسائى ، كتاب السهو، باب الفضل فی الصلاة على النبی <strong>صلى الله عليه وآله وسلم</strong>
            ]
          </span><br />


          حضرت ابوطلحہ رضی اللہ عنہ سے روایت ہے: ایک دن رسول اللہ <strong>صلى الله عليه وآله وسلم</strong>
          تشریف لائے خوشی کے آثار آپؐ کے چہرہ مبارک سے عیاں تھے (ہم نے عرض کیا یا رسول اللّٰه       <strong>صلى الله عليه وآله وسلم</strong>   ! آج تو آپؐ  کا رخ انور خوشی سے تاباں ہے) فرمایا: میرے پاس جبریل علیہ اسلام آئے اور عرض کیا: (اللہ تعالیٰ فرماتا ہے) اے <strong>(<strong>محمد ﷺ</strong>

            )</strong>! کیا آپؐ اس بات پر راضی نہیں ہیں کہ آپؐ کا جو امتی آپؐ پر ایک بار درود بھیجے گا میں اس کو اپنی خصوصی عنائت و توجہ سے دس بار نوازوں گا اور   آپؐ  کا  جو امتی آپؐ پر ایک بار سلام بھیجے گا میں دس بار اس پر سلام بھیجوں گا۔

          <span className="duaa"><br />
            عن عبدالرحمن ابن عوف قال: كان لا يفارق النبی بالليل والنهار خمسة نفر من أصحابه أو أربعة لما
            ينو به من حوائجه ، قال: فجئت فوجدته
            قد خرج فتبعته فدخل حائطا     من حيطان الأسواف ، فصلى فسجد سجدة أطال فيها، فحزنت و بكيت فقلت : لأرى رسول الله قد قبض الله روحه
            ، قال : فرفع  رأسه
            ، و تراءيت له، فدعانى ، فقال : مالك ؟ قلت : يا رسول الله سجدت سجدة أطلت فيها فحزنت ، وبكيت وقلت: لأرى رسول الله
            <strong>صلى الله عليه وآله وسلم</strong>
            قد قبض الله روحه قال : و هذه سجدة سجدتها شكرا لربی فيما آتانی فی امتی من صلى على صلاة كتب الله له عشر حسنات.<br />
            [فضل الصلاة على النبی  للامام حافظ اسماعیل بن اسحاق القاضی الازدی (متوفى ۵۲۸۲ ) بتصحيح الالبانى رقم الحديث : ١٠] <br />
          </span>

          حضرت عبدالرحمن بن عوف رضی اللہ عنہ سے روایت ہے, انہوں نے فرمایا : جناب نبی کریم <strong>صلى الله عليه وآله وسلم</strong>
          کی ضروریات کی تکمیل
          کے لیے آپؐ کے اصحاب میں سے چار یا پانچ افراد کبھی بھی آپؐ سے علیحدہ نہ ہوتے تھے(یعنی ہمیشہ آپؐ کے ساتھ رہتے تھے)۔ انھوں نے فرمایا کہ میں
          ایک دن حاضر ہوا لیکن یہ معلوم کر کے کہ آپؐ کہیں باہر تشریف لے گئے ہیں، میں بھی آپؐ کو ڈھونڈنے  کے  لیے نکلا۔ آپؐ حرم مدینہ کے اندر
          ایک باغ میں گئے، (وہاں) آپؐ نے نماز ادا کی، سجدہ میں
          گئے تو بہت طویل سجدہ کیا (آپؐ کے سجدہ سے نہ اٹھنے کے سبب)۔ میں بہت دلگیر ہو گیا اور رو دیا۔ میں نے (دل میں) کہا  مجھے تو یوں لگتا ہے کہ   (بالآخر) اللہ تعالیٰ نے رسول اللہ
          <strong>صلى الله عليه وآله وسلم</strong>
          کی روح
          قبض کرلی ہے۔   عبدالرحمن بن عوف رضی اللہ عنہ فرماتے ہیں کہ     (بالآخر) پھر آپؐ نے اپنا سر    (مبارک) سجدہ
          سے اٹھایا,میں (خوش ہو کر) آپؐ کے سامنے ہوا تو آپؐ نے  مجھے (اپنے پاس)  بلایا  .آپؐ نے فرمایا: کیا بات ہے؟ میں نے کہا:اے اللہ کے رسول
          <strong>(صلى الله عليه وآله وسلم)</strong>    آپؐ نے اس قدر طویل سجدہ کیا، میں تو (بہت)
          غمزدہ ہو گیا تھا    اور رونے لگا تھا میں نے خیال کیا کہ یوں لگتا ہے رسول اللہ <strong>صلى الله عليه وآله وسلم</strong> کی روح اللہ تعالیٰ نے قبض کر لی  ۔ (اس پر) جناب نبی کریم <strong>صلى الله عليه وآله وسلم</strong> نے فرمایا: یہ
          (جو تم نے دیکھا)سجدہ شکر تھا، جو اپنے رب کے لیے بجا لایااس (عظیم نعمت) پر جو  اللہ تعالیٰ نے مجھے میری امت کی خاطر عطا
          فرمائی   (وہ نعمت یہ ہے)  کہ جو شخص مجھ پر ایک دفعہ درود پڑھے گا اللہ تعالیٰ اس کے لیے دس نیکیاں لکھ دے گا۔

          <br />
          <span className="duaa">
            عن انس بن مالك قال قال رسول الله <strong>صلى الله عليه و آله و سلم</strong> من صلى على صلاة واحدة صلى الله عليه عشر صلوات و حطت عنه
            عشر خطيئات و رفعت له عشر درجات.<br />
            [سنن النسائى كتاب السهو باب الفضل فی الصلاة على النبی <strong>صلى الله عليه وآله وسلم</strong>
            ]
          </span> <br />


          حضرت انس بن مالک رضی اللہ عنہ روایت کرتے ہیں: رسول اللہ <strong>صلى الله عليه وآله وسلم</strong>
          نے فرمایا: جو کوئی مجھ پر ایک بار درود پڑھے گا، اللہ تعالیٰ اس پر دس بار بے پایاں
          رحمتیں بھیجے گااور خصوصی عنایات سے نوازے گا. اس کے دس گناہ معاف ہوں گے اور اس کے دس درجات بلند کیے جائیں گے۔<br />
          <span className='unwan-number'><strong>عنوان نمبر 1</strong></span><br />
          <strong>احادیث مبارکہ کا خلاصہ:</strong>
          جب کوئی خوش بخت امتی رسول اکرم <strong>صلى الله عليه وآله وسلم</strong>
          پر ایک بار درود و سلام بھیجتا ہے تو اس کے نامہ اعمال میں دس نیکیاں لکھ
          دی جاتی ہیں، اس کے دس گناہ معاف کر دیے جاتے ہیں، اس کے دس درجات بلند کر دیے جاتے ہیں اور اللہ تعالیٰ اس کو
          دس مرتبہ اپنی خصوصی عنایت و توجہ سے نوازتا ہے۔ نیز اس سعادت مند پر اللہ تعالیٰ دس مرتبہ سلام بھیجتا ہے۔
        </p>

        <div className="navigation-buttons-next-prev-contents-sayings">
          <button className="next-prev-buttons-contents-sayings" onClick={handlePrevious}>
            {isUrdu ? <span className="urdu-font">پچھلا صفحہ</span> : 'Previous'}
          </button>
          <button className="next-prev-buttons-contents-sayings" onClick={handleNext}>
            {isUrdu ? <span className="urdu-font">اگلا صفحہ</span> : 'Next'}
          </button>
        </div>
      </div>
    </div>
  );
};

export default ContentsDetail6;

