
import React, { useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
// import SideNav from '../SideNav/SideNav';

const ContentsDetail12 = ({ language }) => {
  const navigate = useNavigate();

  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  const handlePrevious = () => {
    navigate('/contents/detail/11');
  };

  const handleNext = () => {
    navigate('/contents/detail/13');
  };

  const isUrdu = language === 'ur';

  return (
    <div className="detail-layout">
      {/* <SideNav /> */}

      <div className="detail-content">
        <h2 className="detail-heading">
          <span>درود شریف پڑھنے سے غفلت پر تنبیہ</span>
        </h2>

        <p className="detail-text-refined-text">

          <span className="duaa">
            عن أبی ذر أن <strong>رسول الله صلى الله عليه وسلم</strong> قال: إن أبخل الناس من ذكرت عنده فلم يصل علی
            .            </span>
          <br />
          <span className="duaa">
            [فضل الصلاة على النبى للإمام حافظ اسماعیل بن اسحاق القاضی الأزدی (متوفى ۲۸۲) بتصحيح الألبانی رقم الحديث ]۳۷
          </span>
          <br />
          حضرت ابو ذر رضی اللہ عنہ سے روایت ہے کہ <strong>رسول اللہ صلى الله عليه وسلم</strong> نے فرمایا: سب بخیلوں  سے زیادہ بخیل وہ  ہے جس کے سامنے میرا ذکر کیا جائے اور وہ مجھ پر درود    (شریف) نہ پڑھے۔
          <br />
          <span className="duaa">
            عن كعب بن عجرة قال : قال <strong>رسول الله صلى الله عليه وسلم</strong> احضروا المنبر فحضرنا فلما ارتقى الدرجة قال: آمين ثم ارتقى الدرجة الثانية فقال: آمين ثم ارتقى الدرجة الثالثة فقال : آمين فلما فرغ نزل عن المنبر ، قال : قلنا له : يا رسول الله لقد سمعنا منك اليوم شيئا ما كنا نسمعه ، قال : إن جبريل عرض لى فقال: بعد من ادرك رمضان فلم يغفر له فقلت: آمين ، فلما رقيت الثانية قال: بعد من ذكرت عنده فلم يصل عليك فقلت : آمين، فلما رقيت الثالثة قال : بعد من أدرك ابويه الكبر أو أحدهما فلم يدخلاه الجنة، فقلت آمين
            .          </span>
          <br />

          <span className="duaa">
            [فضل الصلاة على النبی للإمام حافظ اسماعیل بن اسحاق القاضی الأزدی (متوفی ۲۸۲) بتصحيح الألبانی رقم الحديث ۱۹ --- بحواله الحاكم وصححه]
          </span>
          <br />
          حضرت کعب بن عجرہ رضی اللہ عنہ کہتے ہیں کہ ایک روز <strong>رسول اللہ صلى الله عليه وسلم</strong>
          نے ہمیں منبر کے پاس آنے کا حکم دیا۔ہم (حکمِ عالی کے مطابق)  منبر کے قریب
          آ گئے . جب آپؐ  پہلی سیڑھی پر چڑھے تو فرمایا "آمین"، پھر دوسری پر
          چڑھے تو فرمایا "آمین"،پھر تیسری سیڑھی پر چڑھے   تو فرمایا "آمین"۔   خطبه سے فارغ ہونے کے بعد   جب آپؐ منبرسے نیچے تشریف لائے تو صحابہ رضی اللہ عنہم نے عرض کیا:
          "اے اللہ کے رسولؐ!آج آپؐ سے ہم نے ایسی بات سنی ہے جو اس سے پہلے نہیں سنی تھی"۔ آپؐ نے فرمایا
          : جبریل علیہ السلام تشریف  لائے اور کہا:           "   (اللہ کی رحمت سے)   دور ہوا جس نے رمضان کا مہینہ پایا لیکن اپنے گناہ نہ بخشوائے".  میں نے جواب میں کہا "آمین"۔ پھر جب میں دوسری سیڑھی پر چڑھا تو جبرائیل علیہ السلام نے کہا  "(اللہ کی رحمت سے)" دور ہوا جس کے سامنے آپؐ کا نام لیا جائے لیکن وہ آپؐ پر درود نہ پڑھے".    میں نے جواب میں کہا "آمین"۔  جب تیسری سیڑھی پر چڑھا تو جبرائیل علیہ السلام نے کہا (اللہ کی رحمت سے) دور ہوا جس نے اپنے ماں باپ دونوں یا کسی ایک کو بڑھاپے کی عمر میں پایا لیکن ان کی خدمت کر کے جنت حاصل نہ کی".میں نے جواب میں کہا "آمین"۔
          <br />
          <span className="duaa">
            عن ابن عباس رضی الله عنهما قال قال <strong>رسول الله صلى الله عليه وسلم</strong> من نسى الصلاة علی خطى طريق الجنة.
          </span>
          <br />
          <span className="duaa">
            [صحيح الجامع الصغير وزيادته للألبانی، المجلد الثانی رقم الحديث: ٦٥٦٨ --- بحواله الترغيب ٢٨٤/٢ و فضل الصلاة ٤٢٤١]
          </span>
          <br />
          حضرت عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں: رسول اللہ <strong>صلى الله عليه وسلم</strong> نے فرمایا: جو  مجھ پر درود  شریف پڑھنا  بھول گیا اس نے جنت کا راستہ کھو دیا۔

          <h3 className='unwan-number'>عنوان نمبر 7</h3><br />
          <strong>احادیث مبارکہ کا خلاصہ:</strong>
          ایسا شخص سب بخیلوں سے زیادہ بخیل ہے جس کے سامنے رسول اکرم <strong>صلى الله عليه وسلم</strong> کا اسم گرامی لیا جائے اور وہ آپؐ  پر درود شریف (حتی کہ مختصر ترین <strong>صلى الله عليه وسلم</strong> ) نہ پڑھے۔ ایسے شخص کے لیے جبریل علیہ السلام نے بددعاء کی اور آپؐ نے ”آمین“ کہا. ایک اور موقع پر آپؐ نے فرمایا جو مجھ پر درود شریف پڑھنا بھول گیا اس نے جنت کا
          راستہ کھو دیا۔


        </p>


        <div className="navigation-buttons-next-prev-contents-sayings">
          <button className="next-prev-buttons-contents-sayings" onClick={handlePrevious}>
            {isUrdu ? <span className="urdu-font">پچھلا صفحہ</span> : 'Previous'}
          </button>
          <button className="next-prev-buttons-contents-sayings" onClick={handleNext}>
            {isUrdu ? <span className="urdu-font">اگلا صفحہ</span> : 'Next'}
          </button>
        </div>
      </div>
    </div>
  );
};

export default ContentsDetail12;

