
import React, { useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
// import SideNav from '../SideNav/SideNav';

const ContentsDetail11 = ({ language }) => {
  const navigate = useNavigate();

  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  const handlePrevious = () => {
    window.scrollTo(0, 0);
    navigate('/contents/detail/10');
  };

  const handleNext = () => {
    window.scrollTo(0, 0);
    navigate('/contents/detail/12');
  };

  const isUrdu = language === 'ur';

  return (
    <div className="detail-layout">
      {/* <SideNav /> */}

      <div className="detail-content">
        <h2 className="detail-heading">
          <span>جن موا&nbsp;قع پر درود شریف سے شفاعت واجب ہو جاتی ہے</span>
        </h2>

        <p className="detail-text-refined-text">

          <span className="duaa">
            عن ابی الدرداء رضى الله عنه قال : قال رسول الله <strong>صلى الله عليه وسلم</strong> من صلى على حين يصبح عشرا و حين يمسى عشرا ادركته شفاعتی يوم القيامة .

          </span>
          <br />
          <span className="duaa">
            [صحيح الجامع الصغير وزيادته للالبانی, المجلد الثانی, رقم الحديث : ٦٣٥٧--- بحواله طبرانی فی الكبير ]
          </span>
          <br />

          حضرت ابوالدرداء رضی اللہ کہتے ہیں کہ رسول اللہ <strong>صلى الله عليه وسلم</strong> نے فرمایا: ”جس نے دس مرتبہ صبح اور دس مرتبہ شام کے وقت مجھ پر درود پڑھا اسے روز قیامت میری شفاعت حاصل ہوگی"۔
          <br />
          <span className="duaa">
            عن عبد الله بن عمرو بن العاص رضى الله عنهما انه  سمع النبی يقول : إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا علی فانه من صلى علی صلاة صلى الله عليه بها عشرا ثم سلوا الله لی الوسيلة فإنها منزلة فی

            الجنة لا تنبغى إلا لعبد من عبادالله و ارجو أن أكون أنا هو فمن سأل الله لی الوسيلة حلت عليه الشفاعة.
            <br />
            [صحیح مسلم ، كتاب الصلاة، باب استحباب القول مثل قول المؤذن لمن سمعه ثم يصلى على النبی <strong>صلى الله عليه وسلم</strong> ثم يسأل الله له الوسيلة]
          </span>
          <br />
          حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہما کہتے ہیں: میں نے رسول اللہ <strong>ﷺ</strong> کو فرماتے سنا ہے: ”جب مؤذن کی اذان سنو تو وہی کچھ کہو جو مؤذن کہتا ہے، پھر مجھ پر درود پڑھو کیونکہ مجھ پر درود پڑھنے والے پر اللہ تعالیٰ دس رحمتیں نازل فرماتا ہے۔ اس کے بعد میرے لیے اللہ تعالی سے وسیلہ مانگو۔ وسیلہ جنت میں ایک مقام ہے جو اللہ کے بندوں میں سے کسی ایک بندے کو دیا جائے گا۔ مجھے امید ہے کہ وہ بندہ میں ہی ہوں گا۔ لہذا جو آدمی میرے لیے اللہ سے وسیلہ کی دعاء کرے گا اس کے لیے میری شفاعت واجب ہو جائے گی۔
          <br />
          <span className="duaa">
            عن جابر ابن عبد الله ان رسول الله <strong>صلى الله عليه وسلم</strong> قال من قال حين    یسمع  النداء
            اللّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَوةِ الْقَائِمَةِ اتِ مُحَمَّدَ نِ الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثُهُ مَقَامًا مَحْمُودًا بِالَّذِى وَعَدَّتَه، حلت له شفاعتی يوم القيامة.<br />
            [صحيح البخاری، كتاب الاذان، باب الدعاء عند النداء]
          </span>
          <br />

          حضرت جابر رضی اللہ عنہ سے روایت ہے کہ آنحضرت <strong>صلى الله عليه وسلم</strong> نے فرمایا: جو شخص اذان سن چکے پھر یوں دعا کرے:
          <br />
          <span className="duaa">
            "اللّهُمَّ رَبَّ هذه الدَّعْوَةِ التَّامَّةِ والصَّلوة القائمة ات مُحمَّد الْوَسِيلَةَ وَالْفَضِيلَةَ وَابْعَثْهُ مَقَامًا مَحْمُودًا نِ الَّذِى وَعَدَّتَهُ".
          </span>
          <br />
          (میرے اللہ! جو اس کامل پکار کا اور قائم ہونے والی نماز کا رب ہے محمد <strong>صلى الله عليه وسلم</strong> کو    (قیامت کے دن) وسیلہ اور بڑا مرتبہ عنایت کر اور اس مقام محمود پر ان کو مبعوث فرما جس کا تو نے ان سے وعدہ کیا ہے)... تو روز قیامت میری شفاعت اس کے لیے ضرور ہوگی۔

          <h3 className='unwan-number'>عنوان نمبر 6</h3><br />
          <strong>احادیث مبارکہ کا خلاصہ:</strong>
          رحمت للعالمين رسول اکرم   <strong>صلى الله عليه وسلم</strong> نے   بالخصوص  اس  شخص کے  لیے       قیامت کے ہولناک دن اپنی شفاعت نصیب ہونے کی  بشارت دی ہے ،






          جو صبح و شام کے وقت آپ <strong>ﷺ</strong> پر دس دس مرتبہ درودِ شریف پڑھے (اپنا معمول بنا لے)۔ ایسی ہی بشارت

          اُس خوش بخت کو  بھی دی گئی ہے جو اذان سنتے وقت مؤذن کے کلمات دہرائے ۔ اذان ختم ہونے کے بعد آپ <strong>ﷺ</strong> پر درودِ شریف پڑھے  اور اس کے بعد یہ دعا مانگے:
          <br />
          <span className="duaa">
            "اللَّهُمَّ رَبَّ هذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ القَائِمَةِ، آتِ مُحَمَّدًا الوَسِيلَةَ وَالفَضِيلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ" .
          </span>

        </p>

        <div className="navigation-buttons-next-prev-contents-sayings">
          <button className="next-prev-buttons-contents-sayings" onClick={handlePrevious}>
            {isUrdu ? <span className="urdu-font">پچھلا صفحہ</span> : 'Previous'}
          </button>
          <button className="next-prev-buttons-contents-sayings" onClick={handleNext}>
            {isUrdu ? <span className="urdu-font">اگلا صفحہ</span> : 'Next'}
          </button>
        </div>
      </div>
    </div>
  );
};

export default ContentsDetail11;

