
import React, { useEffect } from 'react';
import { useNavigate } from 'react-router-dom';
// import SideNav from '../SideNav/SideNav';

const ContentsDetail3 = ({ language }) => {
  const navigate = useNavigate();

  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  const handlePrevious = () => {
    window.scrollTo(0, 0);
    navigate('/contents/detail/2');
  };

  const handleNext = () => {
    window.scrollTo(0, 0);
    navigate('/contents/detail/4');
  };

  const isUrdu = language === 'ur';
  return (
    <div className="detail-layout">
      {/* <SideNav /> */}

      <div className="detail-content">
        <h2 className="detail-heading"><span>مقدمہ</span></h2>

        <p className="detail-text-refined-text">

          <span className='edition'>( طبع اول)</span><br />
          پروفیسر ڈاکٹر آغا محمد سلیم اختر <br />
          ایم. فل (مدینہ یونیورسٹی) پی۔ ایچ۔ ڈی ( پنجاب یونیورسٹی ) صدر شعبہ عربی گورنمنٹ کالج فیصل آباد<br />


          <span className="duaa">الحمد لله رب العالمين والصلاة والسلام على خاتم النبيين و اشرف المرسلين سيد الاولين والآخرين محمّد بن عبد الله النبی الأمی وعلى اله و صحبه اجمعین.&nbsp;
          </span>
           <span className="duaa">اما بعد فقد قال رسول الله      <strong>صلى الله عليه وسلم</strong> "من لم يشكر الناس لم يشكر الله “</span>


          <strong>نبی کریم ﷺ</strong> نے فرمایا: "جو انسانوں کا شکر ادا نہیں کرتا وہ گویا اللہ تعالیٰ کا شکر بجا نہیں لاتا۔“
          شکر کسی عطائے نعمت احسان یا نوازش و کرم
          نوازی پر ہوتا ہے۔ احسان و نعمت جس قدر عظیم ہو شکر اسی قدر زیادہ واجب ہوگا۔ اس بسیط ارض پر بسنے والا بڑے سے بڑا انسانؐ جو پوری انسانیت کی فلاح اور تمام بشریت کی کامرانی کا ضامن بن کر مبعوث
          ہوا جسؐ
          کا سینہ بنی نوع انسان کی ہمدردی اور غم
          گساری سے لبریز تھا، جو ہر ہر انسان کے دکھوں کی آنچ اپنے دل میں محسوس کرتا تھا، جس کی ایک ہی خواہش ایک ہی امنگ ایک ہی تڑپ تھی کہ یه انسان دنیا میں الہ حق کے بتائے ہوئے طریق پر عمل کر کے
          اس دنیا میں بھی کامیاب ہو جائیں اور کل قیامت کے دن اپنے آقاؐ کے سامنے سرخرو ہو جائیں اس لیے وہ ماننے والوں پر محبتیں اور شفقتیں نچھاور کرتا اور نہ ماننے والوں کے لیے دن رات کڑھتارہتا
          یہاں تک کہ اللہ تعالی کو کہنا پڑا: <span className="duaa"> "فَلَعَلَّكَ بَاخِعٌ نَّفْسَكَ عَلٰۤى اٰثَارِهِمْ اِنْ لَّمْ یُؤْمِنُوْا بِهٰذَا الْحَدِیْثِ اَسَفًا".</span>
          جو خوب صورت چہرے اور مضبوط و توانا جسم دیکھتا ہے تو اسے یہ فکر

          دامن گیر ہوتی ہے کہ کہیں کل قیامت کے دن یہ جہنم کی آگ کا شکار نہ ہو جائیں جسےؐ

          بالآخر
          یہ کہنا پڑا کہ "ان لوگوں کو کیا ہو گیا
          ہے کہ میری بات پر کان نہیں دھرتے اور پروانہ وار آگ کے گھڑے میں گرنے کے لیے سرپٹ دوڑے ہی چلے جاتے ہیں اور میں پیچھے سے ان کے دامن پکڑ پکڑ کر کھینچ رہا ہوں کہ یہ آگ کا ایندھن نہ بن جائیں"
          تو قرآن نے کہا: <span className="duaa">" لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ".</span>
          جوؐ انسانیت کے درد میں گلا جاتا تھا۔ راتوں کو اُٹھ اُٹھ کر اللہ تعالیٰ کے حضور گڑگڑا کر عرض گزار ہوتا اور پوری رات ایک ہی گزارش میں گزار دیتا
          <span className="duaa">"إنْ تُعَذِّبُهُمْ فَإِنَّهُمْ عِبَادُكَ وَ إِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ".</span>
          جس کا ظرف اس قدر وسیع تھا کہ پوری انسانیت کے دکھ اپنے اندر سمیٹے ہوئے تھا اور پھر انہی دکھوں کو رات کے وقت اپنے رب جلیل کے سامنے پیش کرتا
          ۔ ام المومنین حضرت عائشہ رضی اللہ تعالی عنہا فرماتی ہیں کہ" نبی کریم <strong>ﷺ</strong>  رات کو اللہ تعالیٰ کے سامنے قیام فرماتے تو آپؐ

          کے سینہ مبارک سے ایسی آوازیں آتیں جیسے ہنڈیا پکنے کی آواز".

          <span className="duaa">جزی الله سبحانه و تعالى محمدا عنا و عن جميع امته خير ما یجزی به عباده المحسنين.!</span>
          امت مسلمہ ہی نہیں پوری انسانیت ختم الرسل و النبیینؐ
          کی زیر بارا احسان ہے۔ کوئی اس احسان عظیم کا بدلہ نہیں چکا سکتا۔ ہاں! اللہ تعالیٰ سے دعاء تو کر سکتا ہے کہ اے اللہ تو حضرت محمد <strong>ﷺ</strong> کو پوری انسانیت کی طرف سے بہترین بدلہ عطا
          فرما اور انھیں مقام محمود پر متمکن فرما اس طرح وہ بھی اس عمل میں شامل ہو جائے جو خود ذات باری تعالیٰ اور اس کے فرشتوں کا ہرلمحہ ہرگھڑی کا ہے۔ اس آیت کریمہ کے مفہوم کو ذہن نشین کرتے ہوئے

          <span className="duaa">"إِنَّ ٱللَّهَ وَمَلَائِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّ ۚ يَـٰٓأَيُّهَا ٱلَّذِينَ آمَنُوا۟ صَلُّوا۟ عَلَيْهِ وَسَلِّمُوا۟ تَسْلِيمًا"</span>
          وہ بھی کثرت سے درود و سلام کے نذرانے بھیجتار ہے۔ جناب ذات اقدسؐ اس قدر جامع الرحمات اور منبع البرکات ہے کہ کوئی مسلمان احسان مندی سے سرشار ہو کر اور انسان عظیمؐ کا کسی طور پر بدلہ چکانے کا سوچ کر اللہ تعالی اور
          اس کے فرشتوں والے کام میں شامل ہوتے ہوئے آپؐ پر ایک دفعہ درود وسلام بھیجے تو اس کے بدلے میں اللہ تعالٰی کی مزید دس رحمتوں سے نواز دیا جاتا ہے۔ اب بتایے کہ کوئی اس عظیم ہستی کا احسان چکا
          سکتا ہے؟
          ان کا احسان کون چکا سکتا ہے؟ بس اس سے نسبت و تعلق ہی مضبوط کرنے کی خاطر اخلاص سے پر ,دل کی گہرائیوں سے اٹھتے ہوئے محبتوں سے بھرے درود سلام کے نذرانے صبح و شام پیش کرنے سے تو کوئی عاجز نہیں آسکتا۔
          یہی لگن تھی اور یہی خیال جس نے جناب محترم <span className="highlight-name">حافظ محمد سلیمان</span> صاحب کو اس رسالہ کی ترتیب و تدوین کی طرف مائل کیا۔
          موصوف پر اللہ تعالیٰ کی خاص نوازش ہے کہ پاکستان بننے سے پہلے اور بارہ برس کی عمر تک پہنچنے سے قبل دورۂ حدیث اور حفظ قرآن کی تکمیل  کی سعادت سے بہرہ ور ہوئے۔
          حافظ صاحب تجربہ کار ماہر تعلیم، شعر و ادب کے دلدادہ، علم و تحقیق کے چاہنے والے اور جناب <strong>رسول ﷺ</strong> سے والہانہ عشق رکھنے والے بزرگ ہیں۔
          عشق چاہے دیوانگی کی حد تک بڑھ جائے لیکن ہوش کا دامن ہاتھ سے چھٹنے نہیں دیتے۔
          حدیث کے باب میں، میں نے انھیں بہت محتاط پایا ہے۔ انھوں نے اس رسالہ میں وہی روایات نقل کی ہیں جن کی صحت میں کوئی شبہ نہ تھا۔
          اللہ تعالیٰ ان کی اس سعی جمیل کو مشکور بنائے اور انھیں اس کا بہترین اجر عطا فرمائے۔
          شاید اس اجر کی بہترین صورت ان کے نزدیک یہی ہو کہ یہ رسالہ لوگوں کے درمیان متداول ہو جائے اور ہر زبان درود پاک کے شغل سے تر ہو جائے۔

          <span className="duaa">اللهم صلّ و سلّم وبارك على سيدنا و مولانا محمد احسن
            صلواتك و اتم تسليما تك و اكمل بركاتك كلما ذكره الذاكرون و صلّ و سلّم و بارك على سيدنا و مولانا محمد احسن صلواتك و اتم تسليماتك و اكمل بركاتك كلما غفل عن ذكره الغافلون.</span><br />

          <span className='edition'>( طبع دوم)</span><br />





          <span className="duaa">   الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَالصَّلوةُ وَالسَّلَامُ عَلَى خَاتَمَ النَّبِيِّينَ اشرف المرسلين وعلى اله الطيبين الطاهرين وصحبه سارة الغر المحجلين و من اتبعهم الى يوم الدين, اما بعد:</span>
          <strong>نبی کریم صلی اللہ علیہ وآلہ وسلم</strong> کا ارشاد گرامی جس کا مفہوم اردو میں کچھ اس طرح سے ادا کیا جا سکتا ہے۔ نیکی کے کسی کام کو بھی حقیر نہ جانو چاہے یہی کیوں نہ ہو کہ تم اپنے
          (کسی بھی مسلمان) بھائی کو کھلے (مسکراتے) چہرے سے ملو۔

          ایک دوسری حدیث ہے: <strong>آپ صلی اللہ علیہ وآلہ وسلم</strong> نے فرمایا: ''ایک درہم ایک لاکھ درہم سے سبقت لے گیا۔‘‘

          پھر اس کی وضاحت <strong>آپ صلی اللہ علیہ وآلہ وسلم</strong> نے اس طرح بیان فرمائی کہ: ایک شخص بہت مال دار ہو، وہ اللہ کی راہ میں ایک لاکھ درہم دے دے، دوسرا شخص بہت تنگ دست ہو، جس کے پاس
          (محنت و مشقت سے حاصل کیے) دو درہم ہوں ایک درہم وہ اپنی ضرورت کے لیے رکھ لے اور دوسرا
          درہم اپنے کسی دوسرے ضرورت مند بھائی کو دے دے۔

          <strong>جناب رسول اللہ صلی اللہ علیہ وآلہ وسلم</strong> نے فرمایا: اللہ تعالی کے ہاں اس ایک درہم کی قدر و قیمت اور قبولیت اس ایک لاکھ درہم سے کہیں زیادہ ہے۔

          ان دو احادیث اور اسی مضمون پر بہت
          ساری قرآنی آیات اور احادیث نبویہ پر گہری نظر ڈالنے سے ایک بات بہت کھل کر واضح ہو جاتی ہے اور وہ یہ کہ اشیاء واعمال کی قیمت و عظمت کمیت و جم پر نہیں بلکہ ان کی اساس و بناء دوامور پر ہیں: <br />
          ا۔ حقیقت سے یا حقیقت الامر
          <br />          ۲۔ اخلاص۔

          <br />
          جہاں تک پہلی صورت کا تعلق ہے تو درود شریف کی حقیقت کو جاننے کے لیے اس عظیم ہستی کے عظیم الشان مشن اور اس کی پرشکوہ کامیابی کو پہچاننا ہوگا جس نے عالم بشریت کی
          تقدیر سنوار دی۔
          حضرت ادریس علیہ السلام سے لے کر
          حضرت مسیح علیہ السلام تک انبیاء علیہ السلام کا موکب عظیم ایک ہی مشن کی تکمیل کے لیے کوشاں رہا۔ اس کے باوجود <strong>جناب نبی کریم صلی اللہ علیہ وسلم</strong> کی بعثت کے وقت آباد و معروف دنیا کے مختلف معاشروں کے
          احوال اور ان کے مختلف پہلوؤں کا جائزہ تاریخ عالم میں حضرت انسان جسے اللہ تعالیٰ نے اشرف المخلوقات کے شرف سے نواز ا اور خلیفۃ اللہ فی الارض کے منصب جلیل پر فائز فرمایا خود اللہ الحق کی پہچان کھو
          بیٹھا۔ کہیں بنوت الہی کا فاسد عقیدہ&nbsp; پَنپنا  کہیں ایک اللہ کو
          کئی خداؤں میں بانٹ
          دیا تھا نیکی کا خدا اور تو برائی کا خدا اور کہیں اقانیم ثلاثہ کا شاخسانہ کہیں دیویوں میں قوت سیطرت ونفوذ کا اعتقاد تھا تو کہیں برہمنوں پروہتوں کا تسلط حد تو یہ تھی کہ ہاتھی بندر اور سانپ جیسے جانور
          بلکہ ہوا آگ، پانی، سورج چاند ستاروں تک میں قوت نافذہ مان کر وہ سر جسے الہ حق نے اپنے سامنے جھکا کر ہر چیز سے آزاد کر دیا تھا، جگہ جگہ جبہ سائیوں کی ذلت اٹھائے اذل المخلوقات واسواھا کے قعر مہانت میں ساقط ونگوں تھا۔
          یہ تو انسانی زندگی کا ایک پہلو ہوا۔ اب ذرا اس وقت کے زندہ معاشروں کے
          دوسرے پہلوؤں کا جائزہ لیجیے ۔ اس قدر گھناؤنی اور بھیانک صورت سامنے آئے گی کہ انسانیت ندامت سے سر جھکا لے۔ پھر یکا یک کیسا انقلاب برپا ہوا۔ جزیرۃ العرب کے پسماندہ اور دور دراز علاقے میں لق و دق صحراؤں کے بیچوں بیچ سنگلاخ
          و چٹیل پہاڑیوں کے درمیان مکہ نامی چھوٹے سے شہر اور اس وقت کی مشہور تجارتی منڈی سے روشنی کی ایک کرن پھوٹی جود یکھتے ہی دیکھتے بقعہ نور بن گئی۔ یہ روشنی اس قدر تیز اور منور تھی کہ چار سو عالم سے ظلمتیں چھٹتی چلی گئیں۔
          سورة الفاتحہ آية الكرسى آیتہ الملک، سورۃ الانعام کی آیات سورۃ النور کی آیات اور سورة الحشر کی آخری تین
          آیات کو ملا کر غور فرمائیے الہ حق کا کس قدر واضح تصور ابھرے گا۔ اسی تصور کو <strong>جناب رسول اللہ  صلی اللہ علیہ وسلم</strong>
          نے اپنی امت کے اذہان میں اس قدر پختہ
          فرما دیا تھا کہ حجۃ الوداع کے دوران یوم عرفات کے بارے میں فرمایا کہ جس قدر
          شیطان آج کے دن ذلیل و مہین ہے اس سے پہلے کبھی نہ تھا۔ وہ یا سیت کے عالم میں اپنے سر پر خاک ڈال رہا ہے کہ اسے یقین ہو گیا ہے کہ آج کے بعد اس کی کھلے بندوں پوجا نہ ہوگی اور حجتہ الوداع سے واپسی پر اللہ تعالیٰ نے اپنے حبیبؐ
          کی
          محنتوں کی قبولیت اور ان پر انعام کا یہ مژدہ جانفز اسنایا۔


          <br />
          <span className="duaa">"ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ".</span><br />
          تبھی تو <strong>جناب رسول اللہ  صلی اللہ علیہ وسلم</strong>  نے اپنے ساتھیوں کو یہ خوشخبری سنائی تھی : <span className='duaa'>" تركتكم على الحنيفية البيضاء"</span>
          اور فرمایا: میں تمھارے درمیان
          دو چیزیں چھوڑے جا رہا ہوں۔ اگر تم ان دونوں کو مضبوطی سے تھامے رہے تو کبھی گمراہ نہیں ہو گے۔ کتاب اللہ اور
          میری سنت ۔

          وہ ہستی جو انسانیت کے درد سے ہر
          لحظہ بےتاب اور جس کا ہر لمحہ بشریت کی سرفرازی و کامرانی کے لیے جہد وسعی کا عکاس ہوا جس کی ذات اللہ
          حق کی پہچان جس کا وجود مولائے رحمان و رحیم کی صفات حسنہ کا مظہر ونشان اس پر رب دو جہاں اپنی محبتیں نعمتیں اور رحمتیں
          نچھاور کیوں نہ کرئے اور اس کے فرشتے ہر دم ان میں اضافہ کی دعائیں کیوں نہ کریں اور اللہ تعالیٰ اس مبارک عمل میں ہر
          اس انسان کو جو اس عظیم ہستی کی قدرد منزلت کو جان اور مان لے شرکت کی دعوت کیوں نہ دے۔ اور پھر اس ذات اقدسؐ





          کی برکات کا اندازہ
          تو
          کیجیے کہ
          جو کوئی اللہ تعالیٰ
          کے حکم کی اطاعت میں ان کے لیے ایک دفعہ اللہ تعالی کی رحمت کا طلب گار ہو خود اس پر اللہ تعالیٰ دس دفعہ اپنی رحمتیں نازل
          فرماتے ہیں۔ ایک دفعہ ایک صحابی نے دعا کی قبولیت کے بارے
          میں سوال
          کیا، آپ نے درود شریف کو شامل دعاء کرنے کی تلقین فرمائی۔ اس نے پوچھا: ایک حصہ درود شریف اور تین  حصہ دعا کر لیا کروں؟
          آپؐ
          نے فرمایا:"(درود شریف)  زیادہ  پڑھ لیا کرو"۔


          صحابی نے کہا: "تب تو میں تمام کا تمام درود شریف پڑھ لیا کروں؟" جناب <strong>حضرت محمد صلی اللہ علیہ وآلہ وسلم</strong> نے فرمایا: "تم درود شریف ہی پڑھ لیا کرو تو (اس کی برکت) سے اللہ تعالی تمھاری تمام حاجات خود ہی پوری فرمادیا کریں گے ۔" اس سلسلہ میں کچھ اور کہنے کی ضرورت رہ جاتی ہے کیا؟
          حجم کے اعتبار سے یہ ایک چھوٹا سا رسالہ ہے لیکن اس کا موضوع وہ عظیم الشان عمل ہے جسے خود اللہ تعالی پسند فرمائے اور اس کے فرشتے ہر دم بجالاتے ہیں اور احسان شناس شخص کا فرض ہے کہ وہ محسن انسانیت <strong>حضرت محمد صلی اللہ علیہ وآلہ وسلم</strong> کی احسان مندی کا تقاضا پورا کرتے ہوئے اس مبارک عمل کو دہرا تار ہے۔
          اور جہاں تک دوسری صورت یعنی اخلاص فی العمل کا تعلق ہے تو اس رسالہ نافعہ کے مرتب <span className='highlight-name'>جناب حافظ محمد سلیمان صاحب</span>&nbsp;
          اطال الله بقاءه و بارك فيه و في علمه
          عالم خدار سا فاضل با صفا قدیمی ماہر تعلیم اور تدریسی میدان کے شہسوار ہیں۔ انھیں ایک ایک حدیث کو اکٹھا کرتے
          اس کی صحت و ثقاہت کے بارے میں معلومات
          لیتے اردو میں اس کے معانی لینے میں جان کھپاتے تو دیکھا ہی تھا پھر جس ذوق ولگن سے اس کی طباعت واشاعت کے مختلف
          مراحل سے گزر کر اس رسالہ کی ایک ایک
          کاپی لیے قارئین کے ہاتھوں تک پہنچاتے وقت نظروں میں ایک التجا سمیٹے دیکھا جو چھپائے نہیں چھپتی تھی: "اگر وقت
          بہم ہو جائے تو ضرور پڑھ لیجیے گا"۔ اور
          جب دل کو پھر بھی اطمینان حاصل نہ ہو پاتا تو ایک ہاتھ میں یہ رسالہ تھماتے تو دوسرے ہاتھ کو اپنے دست ریشمی سے
          ہلکا سا دباؤ دیتے ہوئے فرماتے : " اس میں
          کوئی کمی بیشی ہو تو ضرور بتائیے گا۔ اپنے قیمتی مشورہ سے مطلع فرمائیے گا تا کہ آئندہ طبع میں درستی ہو سکے۔“
          یہ سب کچھ اس لیے تھا کہ ہر کوئی اس رسالہ پر ایک نظر ڈال لے پھر اللہ تعالی نے ان کی سعی کو مشکور بھی
          فرمایا ۔ کئی اصحاب جو فضائل درود پر مطلع تو تھے لیکن
          اس طرف توجہ نہ ہونے کے سبب نہ تو خصوصی اہتمام تھا اور نہ ہی عمل میں استمرار " درود و سلام " کے مطالعہ سے ایسے
          متوجہ ہوئے کہ درود مبارک کو حرز جان بنا لیا اور
          ورد زبان کر لیا۔ <span className='highlight-name'>حضرت حافظ صاحب</span> کا یہ  عمل ہے جس کے بارے میں مجھ ناچیز کو عینی شاہد ہونے کے حوالہ سے علم ہو گیا.




          اس کے علاوہ ان کے کس قدر صحالف اعمال ہیں جو خزانہ غیب میں مصون و محفوظ ہیں اور ان کا احاطہ سوائے العلام
          الوھاب کے اور کسی کے بس میں نہیں ۔ میری دعاء ہے رب کریم ان کے لمحات میں اس قدر برکت ڈال دے کہ وہ تا دیر اس
          طرح کے بے شمار اعمال نافعہ کے لیے سعی فرماتے رہیں کہ وہ غیث عمیم کی طرح ہر خشک وتر کے لیے تریاق حیات ہیں۔
          <span className="highlight-name">حافظ صاحب</span>  نے "درود و سلام" کی طبع اول سے ایک ایک نسخہ قارئین تک
          خود جا جاکے پہنچایا اور یوں دیکھتے ہی دیکھتے تمام نسخے
          تمام ہوئے تو احباب کی طرف سے طبع ثانی کا تقاضا ہوا تو <span className="highlight-name">حافظ محمد سلیمان &nbsp;</span>
          صاحب نے ناچیز کو چند سطور بطور پیش لفظ لکھنے کا حکم دیا۔ باعث سعادت
          جانتے ہوئے بندہ نے فوراً حامی بھر لی اور ابتدائی چند سطور لکھ بھی لیں۔ لیکن پھر میری کوتاہیاں غالب آنے لگیں۔
          دن ہفتوں اور ہفتے مہینوں تک پھیلتے چلے گئے


          اس دوران محترم <span className="highlight-name">حافظ صاحب</span> مسلسل تشریف لاتے رہے

          دیکھتے ہی فرماتے:"میں تو یونہی ملنے آیا ہوں" .


          ان الفاظ کی کاٹ تو دل ناتواں ہی جانتا ہے اور جب یہ سب کچھ کارگر
          نہ ہوا تو ایک دن فرمانے لگے طبع ثانی کے لیے تقاضا بہت ہے ادھر کمپیوٹر والے جلدی کر رہے ہیں۔ ایسا کرتے ہیں کہ طبع
          اول کے پیش لفظ کے ساتھ ہی شائع کر دیتے ہیں۔" اور جب میرے چہرے پر ندامت اور گھبراہٹ کے ملے جلے آثار دیکھتے تو
          فرماتے : ” وہ پیش لفظ بہت خوب ہے سب نے تعریف کی ہے"۔ اللہ تعالی ہی جانتے ہیں کہ اس طرح کی گفتگو میرے اور
          <span className="highlight-name">حافظ صاحب</span>  کے درمیان کتنی
          بار ہوئی لیکن ایک بات تو طے ہے کہ اس قد ر صبر و ثبات تو <span className="highlight-name">حافظ صاحب </span>
           ہی کا خاصا ہے اور انھوں نے
          اس سلسلہ
          میں
          جس قدر
          مشقت
          و کلفت اٹھائی
          ہے وہ ان کے
          لیے بلندی درجات
          کا ذریعہ
          بنی ہے تو
          دوسری
          طرف میری کوتاہیوں
          میں اضافے کا
          سبب۔میری 
          خواہش ہے کہ یہ حروف
          نا تمام "درود و سلام" سے منسوب ہو جائیں تو شاید میری نجات کی  کوئی صورت نکل آئے۔


        </p>


        <div className="navigation-buttons-next-prev-contents-sayings">
          <button className="next-prev-buttons-contents-sayings" onClick={handlePrevious}>
            {isUrdu ? <span className="urdu-font">پچھلا صفحہ</span> : 'Previous'}
          </button>
          <button className="next-prev-buttons-contents-sayings" onClick={handleNext}>
            {isUrdu ? <span className="urdu-font">اگلا صفحہ</span> : 'Next'}
          </button>
        </div>
      </div>
    </div>
  );
};

export default ContentsDetail3;

